@pmmluis 👀 ⬇️ 

```
Terraform will perform the following actions:

  # module.az_virtualnetwork.azurerm_subnet.vnet["snet1"] will be created
  + resource "azurerm_subnet" "vnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "172.16.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "snet1"
      + resource_group_name                            = "rg-network-kitchen-dev"
      + virtual_network_name                           = "vnet-kitchens-1"

      + delegation {
          + name = "infradelegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.az_virtualnetwork.azurerm_subnet.vnet["snet2"] will be created
  + resource "azurerm_subnet" "vnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "172.16.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "snet2"
      + resource_group_name                            = "rg-network-kitchen-dev"
      + virtual_network_name                           = "vnet-kitchens-1"
    }

  # module.az_virtualnetwork.azurerm_virtual_network.vnets["vnet1"] will be created
  + resource "azurerm_virtual_network" "vnets" {
      + address_space         = [
          + "172.16.0.0/16",
        ]
      + dns_servers           = (known after apply)
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "westeurope"
      + name                  = "vnet-kitchens-1"
      + resource_group_name   = "rg-network-kitchen-dev"
      + subnet                = (known after apply)
      + tags                  = {
          + "Country"     = "shared"
          + "Environment" = "dev"
          + "Product"     = "internal"
          + "Squad"       = "Infra"
        }
      + vm_protection_enabled = false
    }

  # module.az_virtualnetwork.azurerm_virtual_network.vnets["vnet2"] will be created
  + resource "azurerm_virtual_network" "vnets" {
      + address_space         = [
          + "172.17.0.0/16",
        ]
      + dns_servers           = (known after apply)
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "westeurope"
      + name                  = "vnet-microservices-2"
      + resource_group_name   = "rg-network-kitchen-dev"
      + subnet                = (known after apply)
      + tags                  = {
          + "Country"     = "shared"
          + "Environment" = "dev"
          + "Product"     = "internal"
          + "Squad"       = "Infra"
        }
      + vm_protection_enabled = false
    }

  # module.az_virtualnetwork.azurerm_virtual_network_peering.peers["vnets_to_peer1"] will be created
  + resource "azurerm_virtual_network_peering" "peers" {
      + allow_forwarded_traffic      = (known after apply)
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "vnet-kitchens-1_to_VNET-NetworkPayrollTestNL"
      + remote_virtual_network_id    = "/subscriptions/0abe1f07-d2a2-4c7a-a36c-9e91baa7321d/resourceGroups/RG-NetworkPayrollTestNL/providers/Microsoft.Network/virtualNetworks/VNET-NetworkPayrollTestNL"
      + resource_group_name          = "rg-network-kitchen-dev"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "vnet-kitchens-1"
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```